# <span style="color:blue">Exploring Pandas</span>
Now that we're familiar with Pandas Series and DataFrames, let's delve further into Pandas' more complex capabilities: **grouping**, **sorting**, **merging**, and **binning**. These utilize and build upon the previous concepts we've learned.

---
## <span style="color:blue">Grouping</span>
Pandas has the functionality to group dataframes by unique values in one or multiple columns. This allows for creating informative summaries out of large datasets. For example, if you were analyzing raw census data, grouping would allow you to summarize the data based on *gender* or *age* groupings, or by *city* and *state*.

In [1]:
import pandas as pd

In [2]:
# Create a dataframe to demonstrate grouping

raw_dict = {"Vehicle Type": ["Car", "Car", "SUV", "Car", "Truck", "Truck", "SUV", "Truck", "Car", "SUV", "SUV", "Truck"],
            "Manufacturer": ["Ford", "GM", "Ford", "Chevy", "Ford", "Chevy", "GM", "GM", "Ford", "Chevy", "GM", "Chevy"],
            "Owner": ["Bob", "Andrew", "Sally", "Amanda", "Bill", "Mike", "Lindsey", "Kristen", "Matt", "Anna", "Jon", "Erin"],
            "Horsepower": [265, 190, 240, 350, 365, 400, 275, 300, 185, 280, 310, 240],
            "Torque (lb-ft)": [270, 215, 203, 350, 415, 275, 290, 190, 280, 305, 250, 290],
            "Fuel Economy (mpg)": [25, 27, 22, 31, 19, 17, 23, 18, 27, 21, 19, 18]}
vehicles_df = pd.DataFrame(raw_dict)
vehicles_df

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
0,Car,Ford,Bob,265,270,25
1,Car,GM,Andrew,190,215,27
2,SUV,Ford,Sally,240,203,22
3,Car,Chevy,Amanda,350,350,31
4,Truck,Ford,Bill,365,415,19
5,Truck,Chevy,Mike,400,275,17
6,SUV,GM,Lindsey,275,290,23
7,Truck,GM,Kristen,300,190,18
8,Car,Ford,Matt,185,280,27
9,SUV,Chevy,Anna,280,305,21
10,SUV,GM,Jon,310,250,19
11,Truck,Chevy,Erin,240,290,18

To start grouping a dataframe, run the following:
~~~~{.python}
grouped_df = original_df.groupby('column1')
~~~~

<code class="python">.groupby()</code> returns a "GroupBy" object. In the above line of code, <code class="python">grouped_df</code> is what holds the "GroupBy" object. The variable (column name) that you want to group by is passed into <code class="python">.groupby()</code>. In the above line of code, we are grouping <code class="python">original_df</code> by the unique values in column named <code class="python">'column1'</code>.

This "GroupBy" object is not exactly usable or useful in and of itself. However, running data functions on it (i.e. <code class="python">.sum()</code>, <code class="python">.mean()</code>, etc.) will let you extract useful summary statistics for each group.

In [3]:
# Group vehicles_df by the "Vehicle Type" column

grouped_vehicles_df = vehicles_df.groupby("Vehicle Type")

# Note that the "GroupBy" object by itself is not particularly useful

print(grouped_vehicles_df)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000016EA373D040>

Our `vehicles_df` dataframe contains 12 rows of data. Each row of data represents a specific vehicle model and there are 5 columns, or variables, that describe each model (fuel economy, horsepower, manufacturer, torque, and vehicle type). While this data is useful as is, grouping it lets us extract more insights from it. 

So, we've grouped our `vehicles_df` dataframe by `"Vehicle Type"`, and assigned the resultant "GroupBy" object to `grouped_vehicles_df`. While printing this object offers no useful information, We can run data functions on this "GroupBy" object to obtain summary statistics per each group (i.e. Car, Truck, and SUV).

First, let's obtain a count of all values per vehicle type, across all columns:

In [5]:
grouped_vehicles_df.count()

,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
Vehicle Type,,,,,
Car,4,4,4,4,4
SUV,4,4,4,4,4
Truck,4,4,4,4,4

In [7]:
vehicles_df.groupby("Vehicle Type").count()

,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
Vehicle Type,,,,,
Car,4,4,4,4,4
SUV,4,4,4,4,4
Truck,4,4,4,4,4

In the above line, we simply ran <code class="python">.count()</code> on our entire "GroupBy" object.

We can also run these data functions on one column, or a select few columns. Now, let's find out the average fuel economy per group:

In [6]:
grouped_vehicles_df["Fuel Economy (mpg)"].mean()

Vehicle Type
Car      27.50
SUV      21.25
Truck    18.00
Name: Fuel Economy (mpg), dtype: float64

How about the maximum horsepower and torque per group?

In [7]:
grouped_vehicles_df[["Horsepower", "Torque (lb-ft)"]].max()

              Horsepower  Torque (lb-ft)
Vehicle Type
Car                  350             350
SUV                  310             305
Truck                400             415

Note: running a data function on a "GroupBy" object returns a DataFrame (if 2-D), or a Series (if 1-D). Thus, you can create new dataframes based on the results of these data functions

In [8]:
min_power_tq = grouped_vehicles_df[["Horsepower", "Torque (lb-ft)"]].min()
min_power_tq

              Horsepower  Torque (lb-ft)
Vehicle Type
Car                  185             215
SUV                  240             203
Truck                240             190

In [9]:
# Proving that the result of running data functions on "GroupBy" objects is a dataframe

type(min_power_tq)

pandas.core.frame.DataFrame

One last thing about grouping: **you can group by multiple columns**.

This is useful if you're dealing with demographic data and want to group by city AND state. You can do this by passing in a list that contains the columns you want to group by.

In [10]:
# Group vehicles_df by both Manufacturer AND Vehicle Type

grouped_vehicles_df_2 = vehicles_df.groupby(["Manufacturer", "Vehicle Type"])

# Get averages

grouped_vehicles_df_2.mean()

                           Horsepower  Torque (lb-ft)  Fuel Economy (mpg)
Manufacturer Vehicle Type
Chevy        Car                350.0           350.0                31.0
             SUV                280.0           305.0                21.0
             Truck              320.0           282.5                17.5
Ford         Car                225.0           275.0                26.0
             SUV                240.0           203.0                22.0
             Truck              365.0           415.0                19.0
GM           Car                190.0           215.0                27.0
             SUV                292.5           270.0                21.0
             Truck              300.0           190.0                18.0

---
## <span style="color:blue">Sorting</span>
Pandas makes it possible to sort by the values in different columns in any dataframe. The main function for this is **<code class="python">.sort_values()</code>**.

Let's sort <code class="python">vehicles_df</code>, from our previous example, by fuel economy:

In [11]:
# First, let's see what the unaltered vehicles_df looks like

vehicles_df

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
0,Car,Ford,Bob,265,270,25
1,Car,GM,Andrew,190,215,27
2,SUV,Ford,Sally,240,203,22
3,Car,Chevy,Amanda,350,350,31
4,Truck,Ford,Bill,365,415,19
5,Truck,Chevy,Mike,400,275,17
6,SUV,GM,Lindsey,275,290,23
7,Truck,GM,Kristen,300,190,18
8,Car,Ford,Matt,185,280,27
9,SUV,Chevy,Anna,280,305,21
10,SUV,GM,Jon,310,250,19
11,Truck,Chevy,Erin,240,290,18

In [12]:
# Now, let's sort this dataframe by the "Fuel Economy (mpg)" column

vehicles_df.sort_values("Fuel Economy (mpg)")

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
5,Truck,Chevy,Mike,400,275,17
7,Truck,GM,Kristen,300,190,18
11,Truck,Chevy,Erin,240,290,18
4,Truck,Ford,Bill,365,415,19
10,SUV,GM,Jon,310,250,19
9,SUV,Chevy,Anna,280,305,21
2,SUV,Ford,Sally,240,203,22
6,SUV,GM,Lindsey,275,290,23
0,Car,Ford,Bob,265,270,25
1,Car,GM,Andrew,190,215,27
8,Car,Ford,Matt,185,280,27
3,Car,Chevy,Amanda,350,350,31

Note that <code class="python">.sort_values()</code> sorts ascending (or, from smallest to largest) by default. We can also sort descending by simply passing in <code class="python">ascending=False</code> into <code class="python">.sort_values()</code>

In [13]:
# Sort DESCENDING by the "Fuel Economy (mpg)" column

vehicles_df.sort_values("Fuel Economy (mpg)", ascending=False)

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
3,Car,Chevy,Amanda,350,350,31
1,Car,GM,Andrew,190,215,27
8,Car,Ford,Matt,185,280,27
0,Car,Ford,Bob,265,270,25
6,SUV,GM,Lindsey,275,290,23
2,SUV,Ford,Sally,240,203,22
9,SUV,Chevy,Anna,280,305,21
4,Truck,Ford,Bill,365,415,19
10,SUV,GM,Jon,310,250,19
7,Truck,GM,Kristen,300,190,18
11,Truck,Chevy,Erin,240,290,18
5,Truck,Chevy,Mike,400,275,17

In [14]:
# Creating a new dataframe from the result of running .sort_values()

sorted_df = vehicles_df.sort_values("Fuel Economy (mpg)")
sorted_df.head()

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
5,Truck,Chevy,Mike,400,275,17
7,Truck,GM,Kristen,300,190,18
11,Truck,Chevy,Erin,240,290,18
4,Truck,Ford,Bill,365,415,19
10,SUV,GM,Jon,310,250,19

Note that sorting a dataframe does not reset the row indexes. Once you sort a dataframe, it's best practice to reset the row indexes. Use the **<code class="python">.reset_index()</code>** function to do this.

In [15]:
# Run the .reset_index() on the sorted dataframe
# Pass in drop=True to prevent appending a new column with the old indexes to the dataframe

sorted_df = sorted_df.reset_index(drop=True)
sorted_df.head()

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
0,Truck,Chevy,Mike,400,275,17
1,Truck,GM,Kristen,300,190,18
2,Truck,Chevy,Erin,240,290,18
3,Truck,Ford,Bill,365,415,19
4,SUV,GM,Jon,310,250,19

---
## <span style="color:blue">Merging</span>
Many times, the data you'll want to analyze comes in the form of several tables. Pandas contains a function called **<code class="python">merge()</code>** that will merge two dataframes together.

In order to merge two dataframes successfully, you'll need to specify a column to merge on. This column should be the link that connects the two dataframe (i.e. some sort of ID column).

Let's go through the different types of merges using two dataframes - one that contains an online retailer's purchase data for the past week, and another one that contains data on customers who've signed up for the email list.

In [16]:
# Create the dataframe containing purchase data

purchase_dict = {"Customer ID": [123, 757, 985, 907, 642, 754, 396, 278],
                 "Order Price": [9.99, 15.00, 7.99, 25.00, 18.00, 31.00, 29.99, 17.99],
                 "Category": ["Clothes", "Electronics", "Toys", "Toys", "Clothes", "Toys", "Electronics", "Clothes"]}
purchase_df = pd.DataFrame(purchase_dict)
purchase_df

   Customer ID  Order Price     Category
0          123         9.99      Clothes
1          757        15.00  Electronics
2          985         7.99         Toys
3          907        25.00         Toys
4          642        18.00      Clothes
5          754        31.00         Toys
6          396        29.99  Electronics
7          278        17.99      Clothes

In [17]:
# Create the dataframe containing email list data

email_dict = {"Customer ID": [123, 147, 278, 396, 421, 642, 754],
              "Name": ["Jill", "Tony", "Sarah", "Bill", "Erin", "Tyler", "Amanda"],
              "Email Address": ["jill29@gmail.com", "tony@yahoo.com", "sarah.b@gmail.com", "bill93@gmail.com", "erinm@yahoo.com", "tyler@aol.com", "amanda72@gmail.com"]}
email_df = pd.DataFrame(email_dict)
email_df

   Customer ID    Name       Email Address
0          123    Jill    jill29@gmail.com
1          147    Tony      tony@yahoo.com
2          278   Sarah   sarah.b@gmail.com
3          396    Bill    bill93@gmail.com
4          421    Erin     erinm@yahoo.com
5          642   Tyler       tyler@aol.com
6          754  Amanda  amanda72@gmail.com

Note that the two dataframes share the "Customer ID" column in common. This column is what makes the merge possible.

An **inner merge** joins the two dataframes only where the values in the joining column match. By default, <code class="python">merge()</code> performs an inner merge.

In [18]:
# Performing an inner merge on the two dataframes using the "Customer ID" field
# Pass into merge(): the two dataframes to merge together, as well as the column to merge on
# Note that it only returns the rows where the value in "Customer ID" matched between the two dataframes
# If a row did not contain a match in "Customer ID", it is not returned in the merged dataframe

inner_merge_df = pd.merge(purchase_df, email_df, on="Customer ID")
inner_merge_df

   Customer ID  Order Price     Category    Name       Email Address
0          123         9.99      Clothes    Jill    jill29@gmail.com
1          642        18.00      Clothes   Tyler       tyler@aol.com
2          754        31.00         Toys  Amanda  amanda72@gmail.com
3          396        29.99  Electronics    Bill    bill93@gmail.com
4          278        17.99      Clothes   Sarah   sarah.b@gmail.com

You can think of inner merge we just performed as returning only the orders from customers who've also signed up for the email list. We merge the two dataframes to return only rows where the "Customer ID" value matches (and therefore, appears on both dataframes). Also, the merged dataframe contains all columns from both dataframes.

On the other hand, an **outer merge** joins the two dataframes, even where there isn't a match in the joining column. To perform an outer merge, you must specify it by passing in <code class="python">how="outer"</code> to <code class="python">merge()</code>.

In [19]:
# Performing an outer merge on the two dataframes, again using the "Customer ID" field
# Note that it returns all rows from both dataframes

outer_merge_df = pd.merge(purchase_df, email_df, on="Customer ID", how="outer")
outer_merge_df

   Customer ID  Order Price     Category    Name       Email Address
0          123         9.99      Clothes    Jill    jill29@gmail.com
1          757        15.00  Electronics     NaN                 NaN
2          985         7.99         Toys     NaN                 NaN
3          907        25.00         Toys     NaN                 NaN
4          642        18.00      Clothes   Tyler       tyler@aol.com
5          754        31.00         Toys  Amanda  amanda72@gmail.com
6          396        29.99  Electronics    Bill    bill93@gmail.com
7          278        17.99      Clothes   Sarah   sarah.b@gmail.com
8          147          NaN          NaN    Tony      tony@yahoo.com
9          421          NaN          NaN    Erin     erinm@yahoo.com

The outer merge we just performed returns all rows from both dataframes. If a customer who placed an order in the past week *has not* signed up for the email list (i.e. they are in the <code class="python">purchase_df</code> dataframe, but not the <code class="python">email_df</code> dataframe), Pandas fills in the "Name" and "Email Address" fields with null values (<code class="python">NaN</code>). If someone who has signed up for the email list *has not* placed an order in the past week (i.e. they are in the <code class="python">email_df</code> dataframe, but not the <code class="python">purchase_df</code> dataframe), Pandas fills in the "Category" and "Order Price" with null values (<code class="python">NaN</code>).

Lastly, a **right** or **left merge** joins the two dataframes, but only protects the data in one of the dataframes you're joining together. In other words, it's like an outer merge that only applies to one dataframe. With a right or left merge, rows in the *other* dataframe where there isn't a match in the joining column are dropped.

With Pandas, the **first** dataframe you pass into <code class="python">merge()</code> is considered the **left** dataframe, and the **second** dataframe you pass into <code class="python">merge()</code> is considered the **right** dataframe.

In [20]:
# Performing a left merge on the two dataframes
# Here, purchase_df is the left dataframe, and email_df is the right dataframe

left_merge_df = pd.merge(purchase_df, email_df, on="Customer ID", how="left")
left_merge_df

   Customer ID  Order Price     Category    Name       Email Address
0          123         9.99      Clothes    Jill    jill29@gmail.com
1          757        15.00  Electronics     NaN                 NaN
2          985         7.99         Toys     NaN                 NaN
3          907        25.00         Toys     NaN                 NaN
4          642        18.00      Clothes   Tyler       tyler@aol.com
5          754        31.00         Toys  Amanda  amanda72@gmail.com
6          396        29.99  Electronics    Bill    bill93@gmail.com
7          278        17.99      Clothes   Sarah   sarah.b@gmail.com

In [21]:
# Performing a right merge on the two dataframes
# Here, email_df is the left dataframe and purchase_df is the right dataframe

right_merge_df = pd.merge(email_df, purchase_df, on="Customer ID", how="right")
right_merge_df

   Customer ID    Name       Email Address  Order Price     Category
0          123    Jill    jill29@gmail.com         9.99      Clothes
1          278   Sarah   sarah.b@gmail.com        17.99      Clothes
2          396    Bill    bill93@gmail.com        29.99  Electronics
3          642   Tyler       tyler@aol.com        18.00      Clothes
4          754  Amanda  amanda72@gmail.com        31.00         Toys
5          757     NaN                 NaN        15.00  Electronics
6          985     NaN                 NaN         7.99         Toys
7          907     NaN                 NaN        25.00         Toys

---
## <span style="color:blue">Binning</span>
Often times, it's useful to put numeric data into bins. This allows for more vigorous and customizable analysis of datasets. `cut()` is a function in Pandas that gives you the capability of binning data.

Let's work on binning the "Horsepower" values in `vehicles_df`.

In [22]:
# First, call vehicles_df to examine it

vehicles_df

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg)
0,Car,Ford,Bob,265,270,25
1,Car,GM,Andrew,190,215,27
2,SUV,Ford,Sally,240,203,22
3,Car,Chevy,Amanda,350,350,31
4,Truck,Ford,Bill,365,415,19
5,Truck,Chevy,Mike,400,275,17
6,SUV,GM,Lindsey,275,290,23
7,Truck,GM,Kristen,300,190,18
8,Car,Ford,Matt,185,280,27
9,SUV,Chevy,Anna,280,305,21
10,SUV,GM,Jon,310,250,19
11,Truck,Chevy,Erin,240,290,18

In [23]:
# Create bins and bin labels for the Horsepower column

hp_bins = [180, 200, 350, 400]
hp_labels = ["Slow", "Decent", "Fast"]

# Bin the Horsepower column
# cut() returns a Pandas Series containing each of the binned column's values translated into their corresponding bins

pd.cut(vehicles_df["Horsepower"], hp_bins, labels=hp_labels)

0     Decent
1       Slow
2     Decent
3     Decent
4       Fast
5       Fast
6     Decent
7     Decent
8       Slow
9     Decent
10    Decent
11    Decent
Name: Horsepower, dtype: category
Categories (3, object): [Slow < Decent < Fast]

The syntax for creating the bins may be a bit confusing at first. 

The first argument passed into `cut()` is the dataframe column you'd like to bin.

The second argument passed into `cut()` is a list that is supposed to represent the bins you'd like to create. In the above lines of code, the list `hp_bins` contains four numbers - these numbers represent our **bin edges**. Therefore, when it's passed into `cut()`, Pandas creates **three bins**: 
- the first one ranging from **180 to 200**
- the second one ranging from **200 to 350** 
- the third one ranging from **350 to 400**..

The third argument passed into `cut()` is a list that contains your bin labels. The list `hp_labels` contains 3 strings. When this list is passed into `cut()`: 
- the label **`"Slow"`** is mapped to the bin ranging from **180 to 200**
- the label **`"Decent"`** is mapped to the bin ranging from **200 to 350**
- the label **`"Fast"`** is mapped to the bin ranging from **350 to 400**.

In [24]:
# We can append our bins to vehicles_df

vehicles_df["Speed"] = pd.cut(vehicles_df["Horsepower"], hp_bins, labels=hp_labels)
vehicles_df

,Vehicle Type,Manufacturer,Owner,Horsepower,Torque (lb-ft),Fuel Economy (mpg),Speed
0,Car,Ford,Bob,265,270,25,Decent
1,Car,GM,Andrew,190,215,27,Slow
2,SUV,Ford,Sally,240,203,22,Decent
3,Car,Chevy,Amanda,350,350,31,Decent
4,Truck,Ford,Bill,365,415,19,Fast
5,Truck,Chevy,Mike,400,275,17,Fast
6,SUV,GM,Lindsey,275,290,23,Decent
7,Truck,GM,Kristen,300,190,18,Decent
8,Car,Ford,Matt,185,280,27,Slow
9,SUV,Chevy,Anna,280,305,21,Decent
10,SUV,GM,Jon,310,250,19,Decent
11,Truck,Chevy,Erin,240,290,18,Decent

In [25]:
# Binning adds a new wrinkle to our data, allowing for more vigorous analysis
# For example, we can now group by our bins

grouped_speed_vehicles_df = vehicles_df.groupby("Speed")
grouped_speed_vehicles_df[["Horsepower", "Torque (lb-ft)"]].mean()

        Horsepower  Torque (lb-ft)
Speed
Slow         187.5           247.5
Decent       282.5           268.5
Fast         382.5           345.0

# Importing CSVs

In [37]:
belize_listings_path = "belize_airbnb_listings.csv"
belize_df = pd.read_csv(belize_listings_path)

In [38]:
belize_df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,36666,Mo's Cozy Casa w/ veranda & access to dock,157752,Monique,Belize,Belize Islands,17.74786,-88.02398,Entire home/apt,141,3,250,2/23/2021,2.00,5,225
1,36690,Mo's Cozy Cabana w/ comfy veranda & access to ...,157752,Monique,Belize,Belize Islands,17.74832,-88.02474,Entire home/apt,71,3,316,2/19/2021,2.46,5,164
2,108932,Purple House eco solar w/ ocean & wildlife views,563377,Michael,Belize,Belize Islands,17.73221,-88.03824,Entire home/apt,191,2,30,3/14/2020,0.78,1,364
3,110483,Michelo's fuchsia suite,567809,Michel,Stann Creek,Stann Creek Mainland,16.52114,-88.36926,Hotel room,121,1,27,2/24/2020,0.29,3,331
4,120115,Seaside Villas Second Floor Unit #4,604999,Bobbi,Belize,Belize Islands,17.74166,-88.02395,Entire home/apt,343,1,30,3/18/2020,0.64,22,203